namespace toybox
{

// ファイル名
static const TbChar8* FONT_SJIS_FILENAME = "font\\font_sjis.tga";

// デフォルトのSJISフォントタイルサイズ
static const TbFloat32 FONT_SJIS_TILE_SIZE = 64.0f;

// テクスチャ用情報
/*
static const TbFontTexInfoSJIS FONT_SJIS_INFO[] =
{
#if 1
    { "あ" , 0    , 0 , 43 , 64 } ,
    { "い" , 64   , 0 , 43 , 64 } ,
    { "う" , 64*2 , 0 , 32 , 64 } ,
    { "え" , 64*3 , 0 , 42 , 64 } ,
    { "お" , 64*4 , 0 , 43 , 64 } ,
    { "三" , 64*5 , 0 , 53 , 64 } ,
    { "宅" , 64*6 , 0 , 53 , 64 } ,
    { "俊" , 64*7 , 0 , 53 , 64 } ,
    { "輔" , 64*8 , 0 , 53 , 64 } ,
#else
    { "あ" , 0    , 0 , 41 , 64 } ,
    { "い" , 64   , 0 , 42 , 64 } ,
    { "う" , 64*2 , 0 , 30 , 64 } ,
    { "え" , 64*3 , 0 , 39 , 64 } ,
    { "お" , 64*4 , 0 , 42 , 64 } ,
    { "三" , 64*5 , 0 , 49 , 64 } ,
    { "宅" , 64*6 , 0 , 50 , 64 } ,
    { "俊" , 64*7 , 0 , 50 , 64 } ,
    { "輔" , 64*8 , 0 , 51 , 64 } ,
#endif
};
*/


}
